Shell> pci
pci: Protocol - PciRootBridgeIo not found.
Shell> drivers
            T   D
D           Y C I
R           P F A
V  VERSION  E G G #D #C DRIVER NAME                         IMAGE NAME
== ======== = = = == == =================================== ==========
 A FFFFFFFF ? - -  -  - <null string>
Shell> devices
     T   D
     Y C I
     P F A
CTRL E G G #P #D #C  Device Name
==== = = = == == === =========================================================
Shell> devtree
 Ctrl[01] /VenHw(e61d73b9-a384-4acc-aeab-82e828f3628b)
 Ctrl[04] /VenHw(e61d73b9-a384-4acc-aeab-82e828f3628b)/SD(1)/SD(0)
 Ctrl[05] /VenHw(e61d73b9-a384-4acc-aeab-82e828f3628b)/SD(1)/SD(0)/HD(1,GPT,13285870-6068-4188-a380-fdc2f33d2267,0x800,0xfffff)
 Ctrl[06] /VenHw(e61d73b9-a384-4acc-aeab-82e828f3628b)/SD(1)/SD(0)/HD(2,GPT,928376d7-35ab-4d5a-9f36-64dfae9844c2,0x100800,0x18fff)
 Ctrl[07] /VenHw(e61d73b9-a384-4acc-aeab-82e828f3628b)/eMMC(2)/eMMC(1)
 Ctrl[08] /VenHw(e61d73b9-a384-4acc-aeab-82e828f3628b)/eMMC(2)/eMMC(1)/HD(1,GPT,7a12e4b5-7098-479d-86a5-17f27ba43684,0x800,0x32000)
 Ctrl[09] /VenHw(e61d73b9-a384-4acc-aeab-82e828f3628b)/eMMC(2)/eMMC(1)/HD(2,GPT,e35247dd-c6c1-4d47-acbc-593da3ec3c48,0x32800,0x1d277df)
 Ctrl[0D] /VenHw(e61d73b9-a384-4acc-aeab-82e828f3628b)/MAC(00049f063ef3,1)
Shell> dmpstore
Variable NV+RT+BS 'EFIGlobalVariable:OsIndications' DataSize = 0x08
  00000000: 00 00 00 00 00 00 00 00-                         *........*
Variable RT+BS 'EFIGlobalVariable:SignatureSupport' DataSize = 0x20
  00000000: 26 16 C4 C1 4C 50 92 40-AC A9 41 F9 36 93 43 28  *&...LP.@..A.6.C(*
  00000010: A1 59 C0 A5 E4 94 A7 4A-87 B5 AB 15 5C 2B F0 72  *.Y.....J....\+.r*
Variable RT+BS 'EFIGlobalVariable:OsIndicationsSupported' DataSize = 0x08
  00000000: 1C 00 00 00 00 00 00 00-                         *........*
Variable NV+RT+BS 'EFIGlobalVariable:PlatformLang' DataSize = 0x06
  00000000: 65 6E 2D 55 53 00                                *en-US.*
Variable RT+BS 'EFIGlobalVariable:PlatformLangCodes' DataSize = 0x06
  00000000: 65 6E 2D 55 53 00                                *en-US.*
Variable RT+BS 'EFIGlobalVariable:VendorKeys' DataSize = 0x01
  00000000: 00                                               *.*
Variable RT+BS 'EFIGlobalVariable:DeployedMode' DataSize = 0x01
  00000000: 00                                               *.*
Variable RT+BS 'EFIGlobalVariable:AuditMode' DataSize = 0x01
  00000000: 00                                               *.*
Variable RT+BS 'EFIGlobalVariable:SetupMode' DataSize = 0x01
  00000000: 01                                               *.*
Variable RT+BS 'EFIGlobalVariable:SecureBoot' DataSize = 0x01
  00000000: 00                                               *.*
Shell> dh -d -v
Handle dump
01: DevicePath(BAD19B10)   /VenHw(e61d73b9-a384-4acc-aeab-82e828f3628b) DevicePathToText(BCD8B4F8) DevicePathUtilities(BCD8B508) E617D6
4C-FE08-46DA-F4DC-BBD5870C7300(BCDC4E70) UnicodeCollation2(BCD8BB18) HIIString(BCD8B8E0) HIIDatabase(BCD8B888)
02: SimpleTextOut(BCDC4DD8)   Address: BCDC4DD8 Attrib 07
  *  mode 0: Col 80 Row 25
03: SimpleTextIn(BCDC4D78) SimpleTextInEx(BCDC4D90)
04: DevicePath(B9CD1040)   /VenHw(e61d73b9-a384-4acc-aeab-82e828f3628b)/SD(1)/SD(0) BlockIO(BAD01A78)   Removable MId:1 bsize 200, lblo
ck 3B723FF (31,914,983,424), raw rw !cached
05: DevicePath(B9CCE040)   /VenHw(e61d73b9-a384-4acc-aeab-82e828f3628b)/SD(1)/SD(0)/HD(1,GPT,13285870-6068-4188-a380-fdc2f33d2267,0x800
,0xfffff) BlockIO(BAD1A8F8)   Removable MId:1 bsize 200, lblock FFFFE (536,870,400), partition rw !cached SimpleFileSystem(BAD1AA60)
06: DevicePath(B9CCC040)   /VenHw(e61d73b9-a384-4acc-aeab-82e828f3628b)/SD(1)/SD(0)/HD(2,GPT,928376d7-35ab-4d5a-9f36-64dfae9844c2,0x100
800,0x18fff) BlockIO(BAD1AAF8)   Removable MId:1 bsize 200, lblock 18FFE (52,428,288), partition rw !cached SimpleFileSystem(BAD1AEF0)
07: DevicePath(B9CCB040)   /VenHw(e61d73b9-a384-4acc-aeab-82e828f3628b)/eMMC(2)/eMMC(1) BlockIO(BAD1AF88)   Removable MId:1 bsize 200,
lblock 1D59FFF (15,758,000,128), raw rw !cached
08: DevicePath(B9CC8040)   /VenHw(e61d73b9-a384-4acc-aeab-82e828f3628b)/eMMC(2)/eMMC(1)/HD(1,GPT,7a12e4b5-7098-479d-86a5-17f27ba43684,0
x800,0x32000) BlockIO(BAD1B118)   Removable MId:1 bsize 200, lblock 31FFF (104,857,600), partition rw !cached EFISystemPartition(0) Sim
pleFileSystem(BAD1B2C0)
09: DevicePath(B9CC6040)   /VenHw(e61d73b9-a384-4acc-aeab-82e828f3628b)/eMMC(2)/eMMC(1)/HD(2,GPT,e35247dd-c6c1-4d47-acbc-593da3ec3c48,0
x32800,0x1d277df) BlockIO(BAD1B358)   Removable MId:1 bsize 200, lblock 1D277DE (15,652,077,056), partition rw !cached SimpleFileSystem
(BAD1C4F0)
0A: DriverBinding(BAD17C30)
   Driver Name [0A]   : <Unknown>
   Driver Image Name  : <Unknown>
   Driver Version     : FFFFFFFF
   Driver Type        : <Unknown>
   Configuration      : NO
   Diagnostics        : NO
   Managing           : None
0B: FirmwareManagement(BCD8B600)
0C: GraphicsOutput(BAD1C3C8)   Max Mode..............: 0x00000001
  Current Mode..........: 0x00000000
  Frame Buffer Base.....: 0x00000000BCE00000
  Frame Buffer Size.....: 0x00000000007E9000
  Mode Info Size........: 0x0000000000000024
  Information
    Version.............: 0x00000000
    HorizontalResolution: 1920
    VerticalResolution..: 1080
    Pixel Format........: PixelBlueGreenRedReserved8BitPerColor
    Pixels / Scan Line..: 1920
    Pixel Info
      RedMask...........: 0x00000000
      GreenMask.........: 0x00000000
      BlueMask..........: 0x00000000
  Supported Resolution List
    Resolution[0]:
      Horizontal........: 1920
      Vertical..........: 1080
0D: SimpleNetwork(BAD1C648) DevicePath(B9CBE040)   /VenHw(e61d73b9-a384-4acc-aeab-82e828f3628b)/MAC(00049f063ef3,1) PXEBaseCode(BAD1C96
0)
0E: ImageDevicePath(B9CB0040)   /VenHw(e61d73b9-a384-4acc-aeab-82e828f3628b)/SD(1)/SD(0)/HD(1,GPT,13285870-6068-4188-a380-fdc2f33d2267,
0x800,0xfffff)/efi\boot\bootaa64.efi LoadedImage(BAD02340)   Revision......: 0x00001000
  ParentHandle..: BAD19CB0
  SystemTable...: BCCE3FE8
  DeviceHandle..: BAD1A8D0
  FilePath......: /efi\boot\bootaa64.efi
  PdbFileName...: <null string>
  OptionsSize...: 0
  LoadOptions...: 0
  ImageBase.....: B9C12000
  ImageSize.....: 9E000
  CodeType......: EfiLoaderCode
  DataType......: EfiLoaderData
  Unload........: 0
0F: ImageDevicePath(B9C0F040)   /VenHw(e61d73b9-a384-4acc-aeab-82e828f3628b)/SD(1)/SD(0)/HD(1,GPT,13285870-6068-4188-a380-fdc2f33d2267,
0x800,0xfffff)/\EFI\BOOT/Shell.efi LoadedImage(BAD13260)   Revision......: 0x00001000
  ParentHandle..: BAD023B0
  SystemTable...: BCCE3FE8
  DeviceHandle..: BAD1A8D0
  FilePath......: /\EFI\BOOT/Shell.efi
  PdbFileName...: <null string>
  OptionsSize...: 0
  LoadOptions...: 0
  ImageBase.....: 9B32D000
  ImageSize.....: F1000
  CodeType......: EfiLoaderCode
  DataType......: EfiLoaderData
  Unload........: 0 SimpleTextOut(9B28E048)   Address: 9B28E048 Attrib 07
  *  mode 0: Col 80 Row 25 ShellParameters(9B27B040) Shell(9B409110)
Shell> memmap
Type       Start            End              # Pages          Attributes
Available  0000000040000000-0000000047EF0FFF 0000000000007EF1 0000000000000008
ACPI_Recl  0000000047EF1000-0000000047F0EFFF 000000000000001E 0000000000000008
Available  0000000047F0F000-000000009B1FEFFF 00000000000532F0 0000000000000008
BS_Data    000000009B1FF000-000000009B241FFF 0000000000000043 0000000000000008
Reserved   000000009B242000-000000009B242FFF 0000000000000001 0000000000000008
BS_Data    000000009B243000-000000009B243FFF 0000000000000001 0000000000000008
Reserved   000000009B244000-000000009B244FFF 0000000000000001 0000000000000008
BS_Data    000000009B245000-000000009B246FFF 0000000000000002 0000000000000008
Reserved   000000009B247000-000000009B247FFF 0000000000000001 0000000000000008
BS_Data    000000009B248000-000000009B249FFF 0000000000000002 0000000000000008
Reserved   000000009B24A000-000000009B24AFFF 0000000000000001 0000000000000008
BS_Data    000000009B24B000-000000009B24CFFF 0000000000000002 0000000000000008
Reserved   000000009B24D000-000000009B24DFFF 0000000000000001 0000000000000008
BS_Data    000000009B24E000-000000009B24FFFF 0000000000000002 0000000000000008
Reserved   000000009B250000-000000009B250FFF 0000000000000001 0000000000000008
BS_Data    000000009B251000-000000009B252FFF 0000000000000002 0000000000000008
Reserved   000000009B253000-000000009B254FFF 0000000000000002 0000000000000008
BS_Data    000000009B255000-000000009B258FFF 0000000000000004 0000000000000008
Reserved   000000009B259000-000000009B259FFF 0000000000000001 0000000000000008
BS_Data    000000009B25A000-000000009B25BFFF 0000000000000002 0000000000000008
Reserved   000000009B25C000-000000009B25CFFF 0000000000000001 0000000000000008
BS_Data    000000009B25D000-000000009B260FFF 0000000000000004 0000000000000008
Reserved   000000009B261000-000000009B261FFF 0000000000000001 0000000000000008
BS_Data    000000009B262000-000000009B263FFF 0000000000000002 0000000000000008
Reserved   000000009B264000-000000009B264FFF 0000000000000001 0000000000000008
BS_Data    000000009B265000-000000009B268FFF 0000000000000004 0000000000000008
Reserved   000000009B269000-000000009B269FFF 0000000000000001 0000000000000008
BS_Data    000000009B26A000-000000009B26BFFF 0000000000000002 0000000000000008
Reserved   000000009B26C000-000000009B26CFFF 0000000000000001 0000000000000008
BS_Data    000000009B26D000-000000009B271FFF 0000000000000005 0000000000000008
Reserved   000000009B272000-000000009B272FFF 0000000000000001 0000000000000008
BS_Data    000000009B273000-000000009B278FFF 0000000000000006 0000000000000008
Reserved   000000009B279000-000000009B279FFF 0000000000000001 0000000000000008
BS_Data    000000009B27A000-000000009B32CFFF 00000000000000B3 0000000000000008
LoaderCode 000000009B32D000-000000009B50EFFF 00000000000001E2 0000000000000008
LoaderData 000000009B50F000-000000009B50FFFF 0000000000000001 0000000000000008
LoaderCode 000000009B510000-00000000B9C0AFFF 000000000001E6FB 0000000000000008
BS_Data    00000000B9C0B000-00000000B9C0EFFF 0000000000000004 0000000000000008
Reserved   00000000B9C0F000-00000000B9C11FFF 0000000000000003 0000000000000008
LoaderCode 00000000B9C12000-00000000B9CAFFFF 000000000000009E 0000000000000008
Reserved   00000000B9CB0000-00000000B9CB6FFF 0000000000000007 0000000000000008
BS_Data    00000000B9CB7000-00000000B9CB7FFF 0000000000000001 0000000000000008
RT_Data    00000000B9CB8000-00000000B9CB8FFF 0000000000000001 8000000000000008
BS_Data    00000000B9CB9000-00000000B9CBBFFF 0000000000000003 0000000000000008
RT_Data    00000000B9CBC000-00000000B9CBCFFF 0000000000000001 8000000000000008
BS_Data    00000000B9CBD000-00000000B9CBDFFF 0000000000000001 0000000000000008
Reserved   00000000B9CBE000-00000000B9CBEFFF 0000000000000001 0000000000000008
RT_Data    00000000B9CBF000-00000000B9CC0FFF 0000000000000002 8000000000000008
BS_Data    00000000B9CC1000-00000000B9CC1FFF 0000000000000001 0000000000000008
RT_Data    00000000B9CC2000-00000000B9CC5FFF 0000000000000004 8000000000000008
Reserved   00000000B9CC6000-00000000B9CC6FFF 0000000000000001 0000000000000008
BS_Data    00000000B9CC7000-00000000B9CC7FFF 0000000000000001 0000000000000008
Reserved   00000000B9CC8000-00000000B9CC8FFF 0000000000000001 0000000000000008
BS_Data    00000000B9CC9000-00000000B9CCAFFF 0000000000000002 0000000000000008
Reserved   00000000B9CCB000-00000000B9CCCFFF 0000000000000002 0000000000000008
BS_Data    00000000B9CCD000-00000000B9CCDFFF 0000000000000001 0000000000000008
Reserved   00000000B9CCE000-00000000B9CCEFFF 0000000000000001 0000000000000008
BS_Data    00000000B9CCF000-00000000B9CD0FFF 0000000000000002 0000000000000008
Reserved   00000000B9CD1000-00000000B9CD1FFF 0000000000000001 0000000000000008
BS_Data    00000000B9CD2000-00000000B9CD3FFF 0000000000000002 0000000000000008
LoaderData 00000000B9CD4000-00000000BCCDFFFF 000000000000300C 0000000000000008
RT_Code    00000000BCCE0000-00000000BCCEFFFF 0000000000000010 8000000000000008
LoaderData 00000000BCCF0000-00000000BDFFFFFF 0000000000001310 0000000000000008
Reserved   00000000BE000000-00000000BFFFFFFF 0000000000002000 0000000000000008

  Reserved  :          8,225 Pages (33,689,600 Bytes)
  LoaderCode:        125,307 Pages (513,257,472 Bytes)
  LoaderData:         17,181 Pages (70,373,376 Bytes)
  BS_Code   :              0 Pages (0 Bytes)
  BS_Data   :            304 Pages (1,245,184 Bytes)
  RT_Code   :             16 Pages (65,536 Bytes)
  RT_Data   :              8 Pages (32,768 Bytes)
  ACPI_Recl :             30 Pages (122,880 Bytes)
  ACPI_NVS  :              0 Pages (0 Bytes)
  MMIO      :              0 Pages (0 Bytes)
  MMIO_Port :              0 Pages (0 Bytes)
  PalCode   :              0 Pages (0 Bytes)
  Available :        373,217 Pages (1,528,696,832 Bytes)
  Persistent:              0 Pages (0 Bytes)
              --------------
Total Memory:          2,015 MB (2,113,794,048 Bytes)
Shell> smbiosview
SMBIOS Entry Point Structure:
Anchor String:        _SM_
EPS Checksum:         0x3D
Entry Point Len:      31
Version:              3.0
Number of Structures: 7
Max Struct size:      67
Table Address:        0xB9CB8020
Table Length:         264
Entry Point revision: 0x0
SMBIOS BCD Revision:  0x0
Inter Anchor:         _DMI_
Inter Checksum:       0x34
Formatted Area:
  00000000: 00 00 00 00 00                                   *.....*

=========================================================
Query Structure, conditions are:
QueryType   = Random
QueryHandle = Random
ShowType    = SHOW_DETAIL


=========================================================
Type=0, Handle=0x0
Dump Structure as:
Index=0,Length=0x43,Addr=0xB9CB8020
00000000: 00 18 00 00 01 02 00 00-03 00 80 08 01 00 00 00  *................*
00000010: 00 00 00 0C 15 04 FF FF-55 2D 42 6F 6F 74 00 32  *........U-Boot.2*
00000020: 30 32 31 2E 30 34 2B 66-69 6F 2B 67 66 61 63 37  *021.04+fio+gfac7*
00000030: 63 37 64 66 65 36 00 31-30 2F 30 38 2F 32 30 32  *c7dfe6.10/08/202*
00000040: 31 00 00                                         *1..*
Structure Type: BIOS Information
Format part Len : 24
Structure Handle: 0
Vendor: U-Boot
BiosVersion: 2021.04+fio+gfac7c7dfe6
BiosSegment: 0x0
BiosReleaseDate: 10/08/2021
BiosSize:  64 KB
BIOS Characteristics:
PCI is supported
BIOS is Upgradeable(FLASH)
Selectable Boot is supported
 Bits 32:47 are reserved for BIOS Vendor
 Bits 48:64 are reserved for System Vendor
BIOS Characteristics Extension Byte1:
BIOS Characteristics Extension Byte2:
Enable Targeted Content Distribution
UEFI Specification is supported
 Bits 5:7 are reserved for future assignment
SystemBiosMajorRelease: 21
SystemBiosMinorRelease: 4
EmbeddedControllerFirmwareMajorRelease: 255
EmbeddedControllerFirmwareMinorRelease: 255


=========================================================
Type=1, Handle=0x1
Dump Structure as:
Index=1,Length=0x34,Addr=0xB9CB8063
00000000: 01 1B 01 00 01 02 00 00-00 00 00 00 00 00 00 00  *................*
00000010: 00 00 00 00 00 00 00 00-00 00 00 55 6E 6B 6E 6F  *...........Unkno*
00000020: 77 6E 00 55 6E 6B 6E 6F-77 6E 20 50 72 6F 64 75  *wn.Unknown Produ*
00000030: 63 74 00 00                                      *ct..*
Structure Type: System Information
Format part Len : 27
Structure Handle: 1
Manufacturer: Unknown
ProductName: Unknown Product
Version:
SerialNumber:
Dump Uuid
size=16:
00000000: 00 00 00 00 00 00 00 00-00 00 00 00 00 00 00 00  *................*
System Wakeup Type: Reserved
SKUNumber:
Family:


=========================================================
Type=2, Handle=0x2
Dump Structure as:
Index=2,Length=0x27,Addr=0xB9CB8097
00000000: 02 0E 02 00 01 02 00 00-00 01 00 00 00 0A 55 6E  *..............Un*
00000010: 6B 6E 6F 77 6E 00 55 6E-6B 6E 6F 77 6E 20 50 72  *known.Unknown Pr*
00000020: 6F 64 75 63 74 00 00                             *oduct..*
Structure Type: Base Board Information
Format part Len : 14
Structure Handle: 2
Manufacturer: Unknown
ProductName: Unknown Product
Version:
SerialNumber:
AssetTag:
Base Board Feature Flags: Hosting board
LocationInChassis:
ChassisHandle: 0x0
Base Board Board Type: Motherboard


=========================================================
Type=3, Handle=0x3
Dump Structure as:
Index=3,Length=0x1E,Addr=0xB9CB80BE
00000000: 03 15 03 00 01 03 00 00-00 03 03 03 03 00 00 00  *................*
00000010: 00 00 00 00 00 55 6E 6B-6E 6F 77 6E 00 00        *.....Unknown..*
Structure Type: System Enclosure
Format part Len : 21
Structure Handle: 3
Manufacturer: Unknown
Type: 3
System Enclosure or Chassis Types:  Desktop
Version:
SerialNumber:
AssetTag:
Bootup state System Enclosure or Chassis Status:  Safe
Power Supply State System Enclosure or Chassis Status:  Safe
Thermal state System Enclosure or Chassis Status:  Safe
Security Status System Enclosure or Chassis Security Status:  None
Dump OemDefined
size=4:
00000000: 00 00 00 00                                      *....*
Height: 0
NumberofPowerCords: 0


=========================================================
Type=4, Handle=0x4
Dump Structure as:
Index=4,Length=0x39,Addr=0xB9CB80DC
00000000: 04 30 04 00 00 03 02 01-00 00 00 00 00 00 00 00  *.0..............*
00000010: 01 00 00 00 00 00 00 00-01 06 FF FF FF FF FF FF  *................*
00000020: 00 00 00 00 00 00 00 00-02 00 00 00 00 00 00 00  *................*
00000030: 55 6E 6B 6E 6F 77 6E 00-00                       *Unknown..*
Structure Type: Processor Information
Format part Len : 48
Structure Handle: 4
SocketDesignation:
Processor Type:  Central Processor
Processor Family: Unknown
ProcessorManufacturer: Unknown
Dump ProcessorId
size=8:
00000000: 00 00 00 00 00 00 00 00-                         *........*
ProcessorVersion: Unknown
Processor Information -  Voltage:
ExternalClock: 0
MaxSpeed: 0
CurrentSpeed: 0
Processor Status:
CPU Socket Unpopulated
CPU Enabled
Processor Upgrade: None
L1CacheHandle: 0xFFFF
L2CacheHandle: 0xFFFF
L3CacheHandle: 0xFFFF
SerialNumber:
AssetTag:
PartNumber:
CoreCount: 0
EnabledCoreCount: 0
ThreadCount: 0
Processor Characteristics: No Info
CoreCount2: 0
EnabledCoreCount2: 0
ThreadCount2: 0


=========================================================
Type=32, Handle=0x5
Dump Structure as:
Index=5,Length=0xD,Addr=0xB9CB8115
00000000: 20 0B 05 00 00 00 00 00-00 00 00 00 00           * ............*
Structure Type: System Boot Information
Format part Len : 11
Structure Handle: 5
Dump Reserved
size=6:
00000000: 00 00 00 00 00 00                                *......*
System Boot Status:  No errors detected

=========================================================
Type=127, Handle=0x6
Dump Structure as:
Index=6,Length=0x6,Addr=0xB9CB8122
00000000: 7F 04 06 00 00 00                                *......*
Structure Type: End-of-Table
Format part Len : 4
Structure Handle: 6
This structure indicates the End-of-table!


=========================================================
Shell> acpiview -l
ERROR: Failed to find ACPI Table Guid in System Configuration Table.
Shell> acpiview
ERROR: Failed to find ACPI Table Guid in System Configuration Table.
Shell> acpiview -r 2
ERROR: Failed to find ACPI Table Guid in System Configuration Table.
Shell> CapsuleApp.efi -P
'CapsuleApp.efi' is not recognized as an internal or external command, operable program, or script file.
Shell> CapsuleApp.efi -E
'CapsuleApp.efi' is not recognized as an internal or external command, operable program, or script file.
